apache/nuttx/arch/risc-v/src/esp32c3-legacy/esp32c3_i2c.c
  putreg32(half_cycle / 4, I2C_SDA_HOLD_REG(priv->id));

  /* scl_wait_high < sda_sample <= scl_high */

  putreg32(half_cycle / 2, I2C_SDA_SAMPLE_REG(priv->id));

  putreg32(half_cycle, I2C_SCL_RSTART_SETUP_REG(priv->id));
  putreg32(half_cycle, I2C_SCL_STOP_SETUP_REG(priv->id));
  putreg32(half_cycle - 1, I2C_SCL_START_HOLD_REG(priv->id));
  putreg32(half_cycle, I2C_SCL_STOP_HOLD_REG(priv->id));

  /* By default, we set the timeout value to about 10 bus cycles
   * log(20*half_cycle)/log(2) = log(half_cycle)/log(2) +  log(20)/log(2)
   */

  timeout_cycles  = sizeof(half_cycle) * 8;
  timeout_cycles -= __builtin_clz(5 * half_cycle);
  timeout_cycles += 2;

  reg_value  = I2C_TIME_OUT_EN_M;
  reg_value |= I2C_VALUE_MASK(timeout_cycles, I2C_TIME_OUT_REG);
  putreg32(reg_value, I2C_TO_REG(priv->id));

  priv->clk_freq = bus_freq;
}

/****************************************************************************
 * Name: esp32c3_i2c_init
 *
 * Description:
 *   Initialize I2C hardware.
 *
 * Parameters:
 *   priv          - Pointer to the internal driver state structure.
 *
 ****************************************************************************/

static void esp32c3_i2c_init(struct esp32c3_i2c_priv_s *priv)
{
  const struct esp32c3_i2c_config_s *config = priv->config;

  /* Configure GPIO signals for I2C SCL and SDA pins */

  esp32c3_gpiowrite(config->scl_pin, 1);
  esp32c3_gpiowrite(config->sda_pin, 1);

  esp32c3_configgpio(config->scl_pin, INPUT_PULLUP | OUTPUT_OPEN_DRAIN);
  esp32c3_gpio_matrix_out(config->scl_pin, config->scl_outsig, 0, 0);
  esp32c3_gpio_matrix_in(config->scl_pin, config->scl_insig, 0);

  esp32c3_configgpio(config->sda_pin, INPUT_PULLUP | OUTPUT_OPEN_DRAIN);
  esp32c3_gpio_matrix_out(config->sda_pin, config->sda_outsig, 0, 0);
  esp32c3_gpio_matrix_in(config->sda_pin, config->sda_insig, 0);

  /* Enable I2C hardware */

  modifyreg32(SYSTEM_PERIP_CLK_EN0_REG, 0, config->clk_bit);
  modifyreg32(SYSTEM_PERIP_RST_EN0_REG, config->rst_bit, 0);

  /* Disable I2C interrupts */

  esp32c3_i2c_intr_disable(priv);

  /* Initialize I2C Master  */

  putreg32(I2C_MS_MODE_M | I2C_CLK_EN_M |
           I2C_SCL_FORCE_OUT_M | I2C_SDA_FORCE_OUT_M,
           I2C_CTR_REG(priv->id));

  /* Set FIFO mode */

  modifyreg32(I2C_FIFO_CONF_REG(priv->id), I2C_NONFIFO_EN_M, 0);

  /* Ensure I2C data mode is set to MSB */

  modifyreg32(I2C_CTR_REG(priv->id),
              (I2C_TX_LSB_FIRST_M | I2C_RX_LSB_FIRST_M), 0);

  esp32c3_i2c_reset_fifo(priv);

  /* Configure the hardware filter function */

  putreg32(I2C_SCL_FILTER_EN_M | I2C_SDA_FILTER_EN_M |
           I2C_VALUE_MASK(I2C_FILTER_CYC_NUM_DEF,
                          I2C_SCL_FILTER_THRES) |
           I2C_VALUE_MASK(I2C_FILTER_CYC_NUM_DEF,
                          I2C_SDA_FILTER_THRES),
           I2C_FILTER_CFG_REG(priv->id));

  /* Initialize I2C bus clock */

  esp32c3_i2c_init_clock(priv, config->clk_freq);
}

/****************************************************************************
 * Name: esp32c3_i2c_deinit
 *
 * Description:
 *   Disable I2C hardware.
 *
 * Parameters:
 *   priv          - Pointer to the internal driver state structure.
 *
 ****************************************************************************/

static void esp32c3_i2c_deinit(struct esp32c3_i2c_priv_s *priv)
{
  const struct esp32c3_i2c_config_s *config = priv->config;

  priv->clk_freq = 0;

  modifyreg32(SYSTEM_PERIP_RST_EN0_REG, 0, config->rst_bit);
  modifyreg32(SYSTEM_PERIP_CLK_EN0_REG, config->clk_bit, 0);
}

/****************************************************************************
 * Name: esp32c3_i2c_reset_fsmc
 *
 * Description:
 *   Reset I2C hardware state machine and registers.
 *
 * Parameters:
 *   priv          - Pointer to the internal driver state structure.
 *
 ****************************************************************************/

static void esp32c3_i2c_reset_fsmc(struct esp32c3_i2c_priv_s *priv)
{
  /* Reset FSM machine */

  modifyreg32(I2C_CTR_REG(priv->id), 0, I2C_FSM_RST_M);
}

/****************************************************************************
 * Name: esp32c3_i2c_sem_waitdone
 *
 * Description:
 *   Wait for a transfer to complete.
 *
 * Parameters:
 *   priv          - Pointer to the internal driver state structure.
 *
 * Returned Value:
 *   Zero (OK) is returned on success. A negated errno value is returned on
 *   failure.
 *
 ****************************************************************************/
#ifndef CONFIG_I2C_POLLED
static int esp32c3_i2c_sem_waitdone(struct esp32c3_i2c_priv_s *priv)
{
  return nxsem_tickwait_uninterruptible(&priv->sem_isr,
                                        ESP32C3_I2CTIMEOTICKS);
}
#endif

/****************************************************************************
 * Name: esp32c3_i2c_polling_waitdone
 *
 * Description:
 *   Wait for a transfer to complete by polling status interrupt registers,
 *   which indicates the status of the I2C operations. This function is only
 *   used in polling driven mode.
 *
 * Parameters:
 *   priv          - Pointer to the internal driver state structure.
 *
 * Returned Values:
 *   Zero (OK) is returned on successful transfer. -ETIMEDOUT is returned
 *   in case a transfer didn't finish within the timeout interval. And ERROR
 *   is returned in case of any I2C error during the transfer has happened.
 *
 ****************************************************************************/
#ifdef CONFIG_I2C_POLLED
static int esp32c3_i2c_polling_waitdone(struct esp32c3_i2c_priv_s *priv)
{
  int ret;
  clock_t current;
  clock_t timeout;
  uint32_t status = 0;

  /* Get the current absolute time and add an offset as timeout.
   * Preferable to use monotonic, so in case the time changes,
   * the time reference is kept, i.e., current time can't jump
   * forward and backwards.
   */

  current = clock_systime_ticks();
  timeout = current + SEC2TICK(10);

  /* Loop while a transfer is in progress
   * and an error didn't occur within the timeout
   */

  while ((sclock_t)(current - timeout) < 0 && (priv->error == 0))
    {
      /* Check if any interrupt triggered, clear them
       * process the operation.
       */

      status = getreg32(I2C_INT_STATUS_REG(priv->id));
      if (status != 0)
        {
          /* Check if the stop operation ended. Don't use
           * I2CSTATE_FINISH, because it is set before the stop
           * signal really ends. This works for interrupts because
           * the i2c_state is checked in the next interrupt when
           * stop signal has concluded. This is not the case of
           * polling.
           */

          if (status & I2C_TRANS_COMPLETE_INT_ST_M)
            {
              putreg32(status, I2C_INT_CLR_REG(priv->id));
              break;
            }

